"use strict";

//написати фукцію стрілку, яка приймає джерельний масив 
//і повертає масив з двох значень, 
//які є мінімальним і максимальним значенням джерельного масиву
//якщо джерельний масив порожній, то функція повертає порожній масив



//написати функцію стрілку, яка приймає безліч аргументів
//і повертає результат їх множення, якщо аргументів не має - повертає null



//переписати функцію, що нижче на функцію стрілку
function askUser(quetion){
  const userInput = confirm(quetion);
  if(userInput){
    return 'ok';
  }
  return 'error';
}